use master;
use PunkoUniver;
--create database PunkoUniver;
create table STUDENTES (Номер_зачетки int primary key,Фамилия_студента  nvarchar(20) not null,Дата_рождения date,
						Пол nchar(1) default 'м' check (Пол in ('м', 'ж')), Дата_поступления date);
insert into STUDENTES (Номер_зачетки, Фамилия_студента, Дата_рождения, Пол, Дата_поступления)
values (732846782, 'Пунько', '23.5.2000', 'ж', '1.7.2017'), (47835634, 'Реут', '9.1.1999', 'ж', '1.7.2017'), (347563847, 'Глушакова', '1.5.1999', 'ж', '1.7.2017'),
(437856348, 'Карленок', '20.9.1999', 'м', '1.7.2017'), (849753498, 'Астахова', '16.6.1998', 'ж', '1.7.2017'), (439753489, 'Петух', '1.10.1999','м', '1.7.2017'), (374683242,
 'Бородина', '14.4.2000', 'ж', '1.7.2017');
select Номер_зачетки, Фамилия_студента, Дата_рождения, Пол from STUDENTES
where Dateadd(year, 18, Дата_рождения)<Дата_поступления AND (Пол='ж');
